DataProcessors/Лб_ЗагрузкаФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>Лб_ЗагрузкаФакт</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/Лб_ОДН_Фактические.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Лб_ОДН_Фактические</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.лб_ОДН_факт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФактическиеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОДН_ХВ_М</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОДН_ХВ_Р</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОДН_ГВ_М</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОДН_ГВ_Р</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОДН_ЭЭ_кВт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОДН_ЭЭ_Р</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОДН_ВО_М</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОДН_ВО_Р</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/Лб_ЗагрузкаФакт/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыборФайлаНачалоВыбора(Элемент, СтандартнаяОбработка)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Заголовок                   = "Выберите файл";
	ДиалогОткрытияФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогОткрытияФайла.Фильтр                      = "Таблицы (*.xls,*.xlsx)|*.xls;*.xlsx;|Microsoft Excel 97/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2010 (*.xlsx)|*.xlsx";	
	ДиалогОткрытияФайла.ИндексФильтра               = 0;
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ВыборФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНаСервере()
	Excel = Новый ComОбъект("Excel.Application");
	Книга = Excel.Workbooks.Open(ВыборФайла);
	Лист  = Книга.Sheets(1);
	КолонкаАдрес  = 3;
	КолонкаДата   = 4;
	КолонкаОДНХВР = 14;
	КолонкаОДНХВ  = 13;
	КолонкаОДНГВР = 16;
	КолонкаОДНГВ  = 15;
	КолонкаОДНЭЭР = 18;
	КолонкаОДНЭЭ  = 17;
	КолонкаОДНВО  = 19;
	КолонкаОДНВОР = 20;
	Сч    = 5;
	Отбой = Ложь;
	Пока НЕ Отбой = Истина Цикл
		Если СокрЛП(Лист.Cells(Сч+1,КолонкаАдрес).Text) = "" Тогда
			Отбой = Истина;
		КонецЕсли;
		Дом     = СокрЛП(Лист.Cells(Сч,КолонкаАдрес).Text);
		Период  = СокрЛП(Лист.Cells(Сч,КолонкаДата).Text);
		ОДНХВР  = СтрЗаменить(СокрЛП(Лист.Cells(Сч,КолонкаОДНХВР).Text)," ","");
		ОДНХВ   = СтрЗаменить(СокрЛП(Лист.Cells(Сч,КолонкаОДНХВ).Text)," ","");
		ОДНГВР  = СтрЗаменить(СокрЛП(Лист.Cells(Сч,КолонкаОДНГВР).Text)," ","");
		ОДНГВ   = СтрЗаменить(СокрЛП(Лист.Cells(Сч,КолонкаОДНГВ).Text)," ","");
		ОДНЭЭР  = СтрЗаменить(СокрЛП(Лист.Cells(Сч,КолонкаОДНЭЭР).Text)," ","");
		ОДНЭЭ   = СтрЗаменить(СокрЛП(Лист.Cells(Сч,КолонкаОДНЭЭ).Text)," ","");
		ОДНВО   = СтрЗаменить(СокрЛП(Лист.Cells(Сч,КолонкаОДНВО).Text)," ","");
		ОДНВОР  = СтрЗаменить(СокрЛП(Лист.Cells(Сч,КолонкаОДНВОР).Text)," ","");
		НормПериод    = '000000000000';
		КолСимПер     = СтрДлина(Период);
		НужнКолСимПер = КолСимПер - 5;
		ГодПериод     = Сред(Период,НужнКолСимПер+1,2);
		Если Врег(Лев(Период,НужнКолСимПер)) = "ЯНВАРЬ " Тогда
			НормПериод ="20"+ГодПериод+"01"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "ФЕВРАЛЬ " Тогда
			НормПериод ="20"+ГодПериод+"02"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "МАРТ " Тогда
			НормПериод ="20"+ГодПериод+"03"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "АПРЕЛЬ " Тогда
			НормПериод ="20"+ГодПериод+"04"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "МАЙ " Тогда
			НормПериод ="20"+ГодПериод+"05"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "ИЮНЬ " Тогда
			НормПериод ="20"+ГодПериод+"06"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "ИЮЛЬ " Тогда
			НормПериод ="20"+ГодПериод+"07"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "АВГУСТ " Тогда
			НормПериод ="20"+ГодПериод+"08"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "СЕНТЯБРЬ " Тогда
			НормПериод ="20"+ГодПериод+"09"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "ОКТЯБРЬ " Тогда
			НормПериод ="20"+ГодПериод+"10"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "НОЯБРЬ " Тогда
			НормПериод ="20"+ГодПериод+"11"+"01";
		ИначеЕсли Врег(Лев(Период,НужнКолСимПер)) = "ДЕКАБРЬ " Тогда
			НормПериод ="20"+ГодПериод+"12"+"01";
		КонецЕсли;	
		Адрес = ЗапросАдреса(Дом);

		ЗаписьОДНФ(НормПериод,ОДНГВ,ОДНХВ,ОДНГВР,ОДНХВР,ОДНЭЭ,ОДНЭЭР,ОДНВОР,ОДНВО,Адрес);
		Сч 	   = Сч + 1;	
	КонецЦикла;

КонецПроцедуры
&НаКлиенте
Процедура Загрузить(Команда)
	Д1 = ТекущаяДата();
	ЗагрузитьНаСервере();	
	Д2 = ТекущаяДата();
	Сообщить("-------Время расчета начислений "+Формат((Д1-Д2)/60,"ЧДЦ=1")+" мин.");
КонецПроцедуры
&НаСервере
Функция ЗапросАдреса(Дом)
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СписокЗданий.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
		|ГДЕ
		|	бит_СписокЗданий.КодФИАС = &Дом";
		
		Запрос.УстановитьПараметр("Дом",Дом);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Адрес = ВыборкаДетальныеЗаписи.Ссылка;	
		КонецЦикла;
		Возврат Адрес;

КонецФункции

&НаСервере
Функция ЗапросДокументаОДНфакт(НормПериод)
			Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лб_ОДН_Фактические.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лб_ОДН_Фактические КАК Лб_ОДН_Фактические
		|ГДЕ
		|	Лб_ОДН_Фактические.Период <= &ПериодК
		|	И Лб_ОДН_Фактические.Период >= &ПериодН";
		
		Запрос.УстановитьПараметр("ПериодН", НачалоМесяца(НормПериод));
		Запрос.УстановитьПараметр("ПериодК", КонецМесяца(НормПериод));
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
		

		Если ВыборкаДетальныеЗаписи.Количество() > 0  Тогда
			ОДН_Ф = ВыборкаДетальныеЗаписи[0].Ссылка.ПолучитьОбъект();
		Иначе
			ОДН_Ф = Документы.Лб_ОДН_Фактические.СоздатьДокумент();
			ОДН_Ф.Дата = ТекущаяДата();
			ОДН_Ф.Период = НормПериод;
		КонецЕсли;
		Возврат ОДН_Ф;
КонецФункции

&НаСервере
Процедура ЗаписьОДНФ(НормПериод,ОДНГВ,ОДНХВ,ОДНГВР,ОДНХВР,ОДНЭЭ,ОДНЭЭР, ОДНВОР, ОДНВО,Адрес)
	ОДН_Ф = ЗапросДокументаОДНфакт(НормПериод);
	Проверка = ОДН_Ф.ФактическиеПоказатели.Найти(Адрес,"Адрес");
	Если Проверка = Неопределено Тогда 
		ТабЧасть = ОДН_Ф.ФактическиеПоказатели.Добавить();
		ТабЧасть.Адрес = Адрес;
	Иначе
		ТабЧасть = Проверка;
	КонецЕсли;
	ТабЧасть.ОДН_ГВ_М    = ОДНГВ;
	ТабЧасть.ОДН_ГВ_Р    = ОДНГВР;
	ТабЧасть.ОДН_ХВ_М    = ОДНХВ;
	Табчасть.ОДН_ХВ_Р    = ОДНХВР;
	ТабЧасть.ОДН_ВО_М    = ОДНВО;
	Табчасть.ОДН_ВО_Р    = ОДНВОР;
	Табчасть.ОДН_ЭЭ_кВт  = ОДНЭЭ;
	Табчасть.ОДН_ЭЭ_Р    = ОДНЭЭР;
	ОДН_Ф.Записать(РежимЗаписиДокумента.Запись);
	ОДН_Ф.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
